name: "torch-jit-export_predict"
op {
  input: "data"
  output: "318"
  name: ""
  type: "Cast"
  arg {
    name: "to"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "318"
  input: "_wrapped_model.pixel_mean"
  output: "319"
  name: ""
  type: "Sub"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "319"
  input: "_wrapped_model.pixel_std"
  output: "normalized_data"
  name: ""
  type: "Div"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "normalized_data"
  input: "630"
  input: "632"
  output: "322"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 3
    ints: 3
    ints: 3
    ints: 3
  }
  arg {
    name: "kernels"
    ints: 7
    ints: 7
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 2
    ints: 2
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "322"
  output: "324"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "324"
  output: "325"
  name: ""
  type: "MaxPool"
  arg {
    name: "strides"
    ints: 2
    ints: 2
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "325"
  input: "634"
  input: "636"
  output: "326"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "326"
  output: "328"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "328"
  input: "638"
  input: "640"
  output: "329"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "329"
  output: "331"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "331"
  input: "642"
  input: "644"
  output: "332"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "325"
  input: "646"
  input: "648"
  output: "334"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "332"
  input: "334"
  output: "336"
  name: ""
  type: "Add"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "336"
  output: "337"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "337"
  input: "650"
  input: "652"
  output: "338"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "338"
  output: "340"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "340"
  input: "654"
  input: "656"
  output: "341"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "341"
  output: "343"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "343"
  input: "658"
  input: "660"
  output: "344"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "344"
  input: "337"
  output: "346"
  name: ""
  type: "Add"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "346"
  output: "347"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "347"
  input: "662"
  input: "664"
  output: "348"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "348"
  output: "350"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "350"
  input: "666"
  input: "668"
  output: "351"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "351"
  output: "353"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "353"
  input: "670"
  input: "672"
  output: "354"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "354"
  input: "347"
  output: "356"
  name: ""
  type: "Add"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "356"
  output: "357"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "357"
  input: "674"
  input: "676"
  output: "358"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 2
    ints: 2
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "358"
  output: "360"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "360"
  input: "678"
  input: "680"
  output: "361"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "361"
  output: "363"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "363"
  input: "682"
  input: "684"
  output: "364"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "357"
  input: "686"
  input: "688"
  output: "366"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 2
    ints: 2
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "364"
  input: "366"
  output: "368"
  name: ""
  type: "Add"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "368"
  output: "369"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "369"
  input: "690"
  input: "692"
  output: "370"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "370"
  output: "372"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "372"
  input: "694"
  input: "696"
  output: "373"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "373"
  output: "375"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "375"
  input: "698"
  input: "700"
  output: "376"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "376"
  input: "369"
  output: "378"
  name: ""
  type: "Add"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "378"
  output: "379"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "379"
  input: "702"
  input: "704"
  output: "380"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "380"
  output: "382"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "382"
  input: "706"
  input: "708"
  output: "383"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "383"
  output: "385"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "385"
  input: "710"
  input: "712"
  output: "386"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "386"
  input: "379"
  output: "388"
  name: ""
  type: "Add"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "388"
  output: "389"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "389"
  input: "714"
  input: "716"
  output: "390"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "390"
  output: "392"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "392"
  input: "718"
  input: "720"
  output: "393"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "393"
  output: "395"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "395"
  input: "722"
  input: "724"
  output: "396"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "396"
  input: "389"
  output: "398"
  name: ""
  type: "Add"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "398"
  output: "399"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "399"
  input: "726"
  input: "728"
  output: "400"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 2
    ints: 2
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "400"
  output: "402"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "402"
  input: "730"
  input: "732"
  output: "403"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "403"
  output: "405"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "405"
  input: "734"
  input: "736"
  output: "406"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "399"
  input: "738"
  input: "740"
  output: "408"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 2
    ints: 2
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "406"
  input: "408"
  output: "410"
  name: ""
  type: "Add"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "410"
  output: "411"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "411"
  input: "742"
  input: "744"
  output: "412"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "412"
  output: "414"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "414"
  input: "746"
  input: "748"
  output: "415"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "415"
  output: "417"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "417"
  input: "750"
  input: "752"
  output: "418"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "418"
  input: "411"
  output: "420"
  name: ""
  type: "Add"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "420"
  output: "421"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "421"
  input: "754"
  input: "756"
  output: "422"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "422"
  output: "424"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "424"
  input: "758"
  input: "760"
  output: "425"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "425"
  output: "427"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "427"
  input: "762"
  input: "764"
  output: "428"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "428"
  input: "421"
  output: "430"
  name: ""
  type: "Add"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "430"
  output: "431"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "431"
  input: "766"
  input: "768"
  output: "432"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "432"
  output: "434"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "434"
  input: "770"
  input: "772"
  output: "435"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "435"
  output: "437"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "437"
  input: "774"
  input: "776"
  output: "438"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "438"
  input: "431"
  output: "440"
  name: ""
  type: "Add"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "440"
  output: "441"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "441"
  input: "778"
  input: "780"
  output: "442"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "442"
  output: "444"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "444"
  input: "782"
  input: "784"
  output: "445"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "445"
  output: "447"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "447"
  input: "786"
  input: "788"
  output: "448"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "448"
  input: "441"
  output: "450"
  name: ""
  type: "Add"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "450"
  output: "451"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "451"
  input: "790"
  input: "792"
  output: "452"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "452"
  output: "454"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "454"
  input: "794"
  input: "796"
  output: "455"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "455"
  output: "457"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "457"
  input: "798"
  input: "800"
  output: "458"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "458"
  input: "451"
  output: "460"
  name: ""
  type: "Add"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "460"
  output: "461"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "461"
  input: "802"
  input: "804"
  output: "462"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 2
    ints: 2
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "462"
  output: "464"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "464"
  input: "806"
  input: "808"
  output: "465"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "465"
  output: "467"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "467"
  input: "810"
  input: "812"
  output: "468"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "461"
  input: "814"
  input: "816"
  output: "470"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 2
    ints: 2
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "468"
  input: "470"
  output: "472"
  name: ""
  type: "Add"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "472"
  output: "473"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "473"
  input: "818"
  input: "820"
  output: "474"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "474"
  output: "476"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "476"
  input: "822"
  input: "824"
  output: "477"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "477"
  output: "479"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "479"
  input: "826"
  input: "828"
  output: "480"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "480"
  input: "473"
  output: "482"
  name: ""
  type: "Add"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "482"
  output: "483"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "483"
  input: "830"
  input: "832"
  output: "484"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "484"
  output: "486"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "486"
  input: "834"
  input: "836"
  output: "487"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "487"
  output: "489"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "489"
  input: "838"
  input: "840"
  output: "490"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "490"
  input: "483"
  output: "492"
  name: ""
  type: "Add"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "492"
  output: "493"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "493"
  input: "_wrapped_model.backbone.fpn_lateral5.weight"
  input: "_wrapped_model.backbone.fpn_lateral5.bias"
  output: "494"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "494"
  input: "_wrapped_model.backbone.fpn_output5.weight"
  input: "_wrapped_model.backbone.fpn_output5.bias"
  output: "495"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "494"
  output: "496"
  name: ""
  type: "ResizeNearest"
  arg {
    name: "order"
    s: "NCHW"
  }
  arg {
    name: "width_scale"
    f: 2.0
  }
  arg {
    name: "height_scale"
    f: 2.0
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "461"
  input: "_wrapped_model.backbone.fpn_lateral4.weight"
  input: "_wrapped_model.backbone.fpn_lateral4.bias"
  output: "497"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "497"
  input: "496"
  output: "498"
  name: ""
  type: "Add"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "498"
  input: "_wrapped_model.backbone.fpn_output4.weight"
  input: "_wrapped_model.backbone.fpn_output4.bias"
  output: "499"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "498"
  output: "500"
  name: ""
  type: "ResizeNearest"
  arg {
    name: "order"
    s: "NCHW"
  }
  arg {
    name: "width_scale"
    f: 2.0
  }
  arg {
    name: "height_scale"
    f: 2.0
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "399"
  input: "_wrapped_model.backbone.fpn_lateral3.weight"
  input: "_wrapped_model.backbone.fpn_lateral3.bias"
  output: "501"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "501"
  input: "500"
  output: "502"
  name: ""
  type: "Add"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "502"
  input: "_wrapped_model.backbone.fpn_output3.weight"
  input: "_wrapped_model.backbone.fpn_output3.bias"
  output: "503"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "502"
  output: "504"
  name: ""
  type: "ResizeNearest"
  arg {
    name: "order"
    s: "NCHW"
  }
  arg {
    name: "width_scale"
    f: 2.0
  }
  arg {
    name: "height_scale"
    f: 2.0
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "357"
  input: "_wrapped_model.backbone.fpn_lateral2.weight"
  input: "_wrapped_model.backbone.fpn_lateral2.bias"
  output: "505"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "505"
  input: "504"
  output: "506"
  name: ""
  type: "Add"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "506"
  input: "_wrapped_model.backbone.fpn_output2.weight"
  input: "_wrapped_model.backbone.fpn_output2.bias"
  output: "507"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "495"
  output: "508"
  name: ""
  type: "MaxPool"
  arg {
    name: "strides"
    ints: 2
    ints: 2
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "507"
  input: "_wrapped_model.proposal_generator.rpn_head.conv.weight"
  input: "_wrapped_model.proposal_generator.rpn_head.conv.bias"
  output: "509"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "509"
  output: "510"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "510"
  input: "_wrapped_model.proposal_generator.rpn_head.objectness_logits.weight"
  input: "_wrapped_model.proposal_generator.rpn_head.objectness_logits.bias"
  output: "511"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "510"
  input: "_wrapped_model.proposal_generator.rpn_head.anchor_deltas.weight"
  input: "_wrapped_model.proposal_generator.rpn_head.anchor_deltas.bias"
  output: "512"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "503"
  input: "_wrapped_model.proposal_generator.rpn_head.conv.weight"
  input: "_wrapped_model.proposal_generator.rpn_head.conv.bias"
  output: "513"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "513"
  output: "514"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "514"
  input: "_wrapped_model.proposal_generator.rpn_head.objectness_logits.weight"
  input: "_wrapped_model.proposal_generator.rpn_head.objectness_logits.bias"
  output: "515"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "514"
  input: "_wrapped_model.proposal_generator.rpn_head.anchor_deltas.weight"
  input: "_wrapped_model.proposal_generator.rpn_head.anchor_deltas.bias"
  output: "516"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "499"
  input: "_wrapped_model.proposal_generator.rpn_head.conv.weight"
  input: "_wrapped_model.proposal_generator.rpn_head.conv.bias"
  output: "517"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "517"
  output: "518"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "518"
  input: "_wrapped_model.proposal_generator.rpn_head.objectness_logits.weight"
  input: "_wrapped_model.proposal_generator.rpn_head.objectness_logits.bias"
  output: "519"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "518"
  input: "_wrapped_model.proposal_generator.rpn_head.anchor_deltas.weight"
  input: "_wrapped_model.proposal_generator.rpn_head.anchor_deltas.bias"
  output: "520"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "495"
  input: "_wrapped_model.proposal_generator.rpn_head.conv.weight"
  input: "_wrapped_model.proposal_generator.rpn_head.conv.bias"
  output: "521"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "521"
  output: "522"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "522"
  input: "_wrapped_model.proposal_generator.rpn_head.objectness_logits.weight"
  input: "_wrapped_model.proposal_generator.rpn_head.objectness_logits.bias"
  output: "523"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "522"
  input: "_wrapped_model.proposal_generator.rpn_head.anchor_deltas.weight"
  input: "_wrapped_model.proposal_generator.rpn_head.anchor_deltas.bias"
  output: "524"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "508"
  input: "_wrapped_model.proposal_generator.rpn_head.conv.weight"
  input: "_wrapped_model.proposal_generator.rpn_head.conv.bias"
  output: "525"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "525"
  output: "526"
  name: ""
  type: "Relu"
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "526"
  input: "_wrapped_model.proposal_generator.rpn_head.objectness_logits.weight"
  input: "_wrapped_model.proposal_generator.rpn_head.objectness_logits.bias"
  output: "527"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "526"
  input: "_wrapped_model.proposal_generator.rpn_head.anchor_deltas.weight"
  input: "_wrapped_model.proposal_generator.rpn_head.anchor_deltas.bias"
  output: "528"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "511"
  input: "512"
  input: "im_info"
  input: "_wrapped_model.proposal_generator.anchor_generator.cell_anchors.0"
  output: "x.54"
  output: "x.59"
  name: ""
  type: "GenerateProposals"
  arg {
    name: "spatial_scale"
    f: 0.25
  }
  arg {
    name: "pre_nms_topN"
    i: 1000
  }
  arg {
    name: "post_nms_topN"
    i: 1000
  }
  arg {
    name: "nms_thresh"
    f: 0.699999988079071
  }
  arg {
    name: "min_size"
    f: 0.0
  }
  arg {
    name: "angle_bound_on"
    i: 1
  }
  arg {
    name: "angle_bound_lo"
    i: -180
  }
  arg {
    name: "angle_bound_hi"
    i: 180
  }
  arg {
    name: "clip_angle_thresh"
    f: 1.0
  }
  arg {
    name: "legacy_plus_one"
    i: 0
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "515"
  input: "516"
  input: "im_info"
  input: "_wrapped_model.proposal_generator.anchor_generator.cell_anchors.1"
  output: "x.55"
  output: "x.60"
  name: ""
  type: "GenerateProposals"
  arg {
    name: "spatial_scale"
    f: 0.125
  }
  arg {
    name: "pre_nms_topN"
    i: 1000
  }
  arg {
    name: "post_nms_topN"
    i: 1000
  }
  arg {
    name: "nms_thresh"
    f: 0.699999988079071
  }
  arg {
    name: "min_size"
    f: 0.0
  }
  arg {
    name: "angle_bound_on"
    i: 1
  }
  arg {
    name: "angle_bound_lo"
    i: -180
  }
  arg {
    name: "angle_bound_hi"
    i: 180
  }
  arg {
    name: "clip_angle_thresh"
    f: 1.0
  }
  arg {
    name: "legacy_plus_one"
    i: 0
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "519"
  input: "520"
  input: "im_info"
  input: "_wrapped_model.proposal_generator.anchor_generator.cell_anchors.2"
  output: "x.56"
  output: "x.61"
  name: ""
  type: "GenerateProposals"
  arg {
    name: "spatial_scale"
    f: 0.0625
  }
  arg {
    name: "pre_nms_topN"
    i: 1000
  }
  arg {
    name: "post_nms_topN"
    i: 1000
  }
  arg {
    name: "nms_thresh"
    f: 0.699999988079071
  }
  arg {
    name: "min_size"
    f: 0.0
  }
  arg {
    name: "angle_bound_on"
    i: 1
  }
  arg {
    name: "angle_bound_lo"
    i: -180
  }
  arg {
    name: "angle_bound_hi"
    i: 180
  }
  arg {
    name: "clip_angle_thresh"
    f: 1.0
  }
  arg {
    name: "legacy_plus_one"
    i: 0
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "523"
  input: "524"
  input: "im_info"
  input: "_wrapped_model.proposal_generator.anchor_generator.cell_anchors.3"
  output: "x.57"
  output: "x.62"
  name: ""
  type: "GenerateProposals"
  arg {
    name: "spatial_scale"
    f: 0.03125
  }
  arg {
    name: "pre_nms_topN"
    i: 1000
  }
  arg {
    name: "post_nms_topN"
    i: 1000
  }
  arg {
    name: "nms_thresh"
    f: 0.699999988079071
  }
  arg {
    name: "min_size"
    f: 0.0
  }
  arg {
    name: "angle_bound_on"
    i: 1
  }
  arg {
    name: "angle_bound_lo"
    i: -180
  }
  arg {
    name: "angle_bound_hi"
    i: 180
  }
  arg {
    name: "clip_angle_thresh"
    f: 1.0
  }
  arg {
    name: "legacy_plus_one"
    i: 0
  }
  device_option {
    device_type: 1
    device_id: 0
  }
}
op {
  input: "527"
  input: "528"
  input: "im_info"
  input: "_wrapped_model.proposal_generator.anchor_generator.cell_anchors.4"
  output: "x.58"
