name: "torch-jit-export_predict"
op {
  input: "data"
  output: "573"
  name: ""
  type: "Cast"
  arg {
    name: "to"
    i: 1
  }
}
op {
  input: "573"
  input: "_wrapped_model.pixel_mean"
  output: "574"
  name: ""
  type: "Sub"
}
op {
  input: "574"
  input: "_wrapped_model.pixel_std"
  output: "normalized_data"
  name: ""
  type: "Div"
}
op {
  input: "normalized_data"
  input: "1021"
  input: "1023"
  output: "577"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 3
    ints: 3
    ints: 3
    ints: 3
  }
  arg {
    name: "kernels"
    ints: 7
    ints: 7
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 2
    ints: 2
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "577"
  output: "579"
  name: ""
  type: "Relu"
}
op {
  input: "579"
  output: "580"
  name: ""
  type: "MaxPool"
  arg {
    name: "strides"
    ints: 2
    ints: 2
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
}
op {
  input: "580"
  input: "1025"
  input: "1027"
  output: "581"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "581"
  output: "583"
  name: ""
  type: "Relu"
}
op {
  input: "583"
  input: "1029"
  input: "1031"
  output: "584"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "584"
  output: "586"
  name: ""
  type: "Relu"
}
op {
  input: "586"
  input: "1033"
  input: "1035"
  output: "587"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "580"
  input: "1037"
  input: "1039"
  output: "589"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "587"
  input: "589"
  output: "591"
  name: ""
  type: "Add"
}
op {
  input: "591"
  output: "592"
  name: ""
  type: "Relu"
}
op {
  input: "592"
  input: "1041"
  input: "1043"
  output: "593"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "593"
  output: "595"
  name: ""
  type: "Relu"
}
op {
  input: "595"
  input: "1045"
  input: "1047"
  output: "596"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "596"
  output: "598"
  name: ""
  type: "Relu"
}
op {
  input: "598"
  input: "1049"
  input: "1051"
  output: "599"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "599"
  input: "592"
  output: "601"
  name: ""
  type: "Add"
}
op {
  input: "601"
  output: "602"
  name: ""
  type: "Relu"
}
op {
  input: "602"
  input: "1053"
  input: "1055"
  output: "603"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "603"
  output: "605"
  name: ""
  type: "Relu"
}
op {
  input: "605"
  input: "1057"
  input: "1059"
  output: "606"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "606"
  output: "608"
  name: ""
  type: "Relu"
}
op {
  input: "608"
  input: "1061"
  input: "1063"
  output: "609"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "609"
  input: "602"
  output: "611"
  name: ""
  type: "Add"
}
op {
  input: "611"
  output: "612"
  name: ""
  type: "Relu"
}
op {
  input: "612"
  input: "1065"
  input: "1067"
  output: "613"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 2
    ints: 2
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "613"
  output: "615"
  name: ""
  type: "Relu"
}
op {
  input: "615"
  input: "1069"
  input: "1071"
  output: "616"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "616"
  output: "618"
  name: ""
  type: "Relu"
}
op {
  input: "618"
  input: "1073"
  input: "1075"
  output: "619"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "612"
  input: "1077"
  input: "1079"
  output: "621"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 2
    ints: 2
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "619"
  input: "621"
  output: "623"
  name: ""
  type: "Add"
}
op {
  input: "623"
  output: "624"
  name: ""
  type: "Relu"
}
op {
  input: "624"
  input: "1081"
  input: "1083"
  output: "625"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "625"
  output: "627"
  name: ""
  type: "Relu"
}
op {
  input: "627"
  input: "1085"
  input: "1087"
  output: "628"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "628"
  output: "630"
  name: ""
  type: "Relu"
}
op {
  input: "630"
  input: "1089"
  input: "1091"
  output: "631"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "631"
  input: "624"
  output: "633"
  name: ""
  type: "Add"
}
op {
  input: "633"
  output: "634"
  name: ""
  type: "Relu"
}
op {
  input: "634"
  input: "1093"
  input: "1095"
  output: "635"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "635"
  output: "637"
  name: ""
  type: "Relu"
}
op {
  input: "637"
  input: "1097"
  input: "1099"
  output: "638"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "638"
  output: "640"
  name: ""
  type: "Relu"
}
op {
  input: "640"
  input: "1101"
  input: "1103"
  output: "641"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "641"
  input: "634"
  output: "643"
  name: ""
  type: "Add"
}
op {
  input: "643"
  output: "644"
  name: ""
  type: "Relu"
}
op {
  input: "644"
  input: "1105"
  input: "1107"
  output: "645"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "645"
  output: "647"
  name: ""
  type: "Relu"
}
op {
  input: "647"
  input: "1109"
  input: "1111"
  output: "648"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "648"
  output: "650"
  name: ""
  type: "Relu"
}
op {
  input: "650"
  input: "1113"
  input: "1115"
  output: "651"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "651"
  input: "644"
  output: "653"
  name: ""
  type: "Add"
}
op {
  input: "653"
  output: "654"
  name: ""
  type: "Relu"
}
op {
  input: "654"
  input: "1117"
  input: "1119"
  output: "655"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 2
    ints: 2
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "655"
  output: "657"
  name: ""
  type: "Relu"
}
op {
  input: "657"
  input: "1121"
  input: "1123"
  output: "658"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "658"
  output: "660"
  name: ""
  type: "Relu"
}
op {
  input: "660"
  input: "1125"
  input: "1127"
  output: "661"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "654"
  input: "1129"
  input: "1131"
  output: "663"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 2
    ints: 2
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "661"
  input: "663"
  output: "665"
  name: ""
  type: "Add"
}
op {
  input: "665"
  output: "666"
  name: ""
  type: "Relu"
}
op {
  input: "666"
  input: "1133"
  input: "1135"
  output: "667"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "667"
  output: "669"
  name: ""
  type: "Relu"
}
op {
  input: "669"
  input: "1137"
  input: "1139"
  output: "670"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "670"
  output: "672"
  name: ""
  type: "Relu"
}
op {
  input: "672"
  input: "1141"
  input: "1143"
  output: "673"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "673"
  input: "666"
  output: "675"
  name: ""
  type: "Add"
}
op {
  input: "675"
  output: "676"
  name: ""
  type: "Relu"
}
op {
  input: "676"
  input: "1145"
  input: "1147"
  output: "677"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "677"
  output: "679"
  name: ""
  type: "Relu"
}
op {
  input: "679"
  input: "1149"
  input: "1151"
  output: "680"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "680"
  output: "682"
  name: ""
  type: "Relu"
}
op {
  input: "682"
  input: "1153"
  input: "1155"
  output: "683"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "683"
  input: "676"
  output: "685"
  name: ""
  type: "Add"
}
op {
  input: "685"
  output: "686"
  name: ""
  type: "Relu"
}
op {
  input: "686"
  input: "1157"
  input: "1159"
  output: "687"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "687"
  output: "689"
  name: ""
  type: "Relu"
}
op {
  input: "689"
  input: "1161"
  input: "1163"
  output: "690"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "690"
  output: "692"
  name: ""
  type: "Relu"
}
op {
  input: "692"
  input: "1165"
  input: "1167"
  output: "693"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "693"
  input: "686"
  output: "695"
  name: ""
  type: "Add"
}
op {
  input: "695"
  output: "696"
  name: ""
  type: "Relu"
}
op {
  input: "696"
  input: "1169"
  input: "1171"
  output: "697"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "697"
  output: "699"
  name: ""
  type: "Relu"
}
op {
  input: "699"
  input: "1173"
  input: "1175"
  output: "700"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "700"
  output: "702"
  name: ""
  type: "Relu"
}
op {
  input: "702"
  input: "1177"
  input: "1179"
  output: "703"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "703"
  input: "696"
  output: "705"
  name: ""
  type: "Add"
}
op {
  input: "705"
  output: "706"
  name: ""
  type: "Relu"
}
op {
  input: "706"
  input: "1181"
  input: "1183"
  output: "707"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "707"
  output: "709"
  name: ""
  type: "Relu"
}
op {
  input: "709"
  input: "1185"
  input: "1187"
  output: "710"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "710"
  output: "712"
  name: ""
  type: "Relu"
}
op {
  input: "712"
  input: "1189"
  input: "1191"
  output: "713"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "713"
  input: "706"
  output: "715"
  name: ""
  type: "Add"
}
op {
  input: "715"
  output: "716"
  name: ""
  type: "Relu"
}
op {
  input: "716"
  input: "1193"
  input: "1195"
  output: "717"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "717"
  output: "719"
  name: ""
  type: "Relu"
}
op {
  input: "719"
  input: "1197"
  input: "1199"
  output: "720"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "720"
  output: "722"
  name: ""
  type: "Relu"
}
op {
  input: "722"
  input: "1201"
  input: "1203"
  output: "723"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "723"
  input: "716"
  output: "725"
  name: ""
  type: "Add"
}
op {
  input: "725"
  output: "726"
  name: ""
  type: "Relu"
}
op {
  input: "726"
  input: "1205"
  input: "1207"
  output: "727"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "727"
  output: "729"
  name: ""
  type: "Relu"
}
op {
  input: "729"
  input: "1209"
  input: "1211"
  output: "730"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "730"
  output: "732"
  name: ""
  type: "Relu"
}
op {
  input: "732"
  input: "1213"
  input: "1215"
  output: "733"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "733"
  input: "726"
  output: "735"
  name: ""
  type: "Add"
}
op {
  input: "735"
  output: "736"
  name: ""
  type: "Relu"
}
op {
  input: "736"
  input: "1217"
  input: "1219"
  output: "737"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "737"
  output: "739"
  name: ""
  type: "Relu"
}
op {
  input: "739"
  input: "1221"
  input: "1223"
  output: "740"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "740"
  output: "742"
  name: ""
  type: "Relu"
}
op {
  input: "742"
  input: "1225"
  input: "1227"
  output: "743"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "743"
  input: "736"
  output: "745"
  name: ""
  type: "Add"
}
op {
  input: "745"
  output: "746"
  name: ""
  type: "Relu"
}
op {
  input: "746"
  input: "1229"
  input: "1231"
  output: "747"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "747"
  output: "749"
  name: ""
  type: "Relu"
}
op {
  input: "749"
  input: "1233"
  input: "1235"
  output: "750"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "750"
  output: "752"
  name: ""
  type: "Relu"
}
op {
  input: "752"
  input: "1237"
  input: "1239"
  output: "753"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "753"
  input: "746"
  output: "755"
  name: ""
  type: "Add"
}
op {
  input: "755"
  output: "756"
  name: ""
  type: "Relu"
}
op {
  input: "756"
  input: "1241"
  input: "1243"
  output: "757"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "757"
  output: "759"
  name: ""
  type: "Relu"
}
op {
  input: "759"
  input: "1245"
  input: "1247"
  output: "760"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "760"
  output: "762"
  name: ""
  type: "Relu"
}
op {
  input: "762"
  input: "1249"
  input: "1251"
  output: "763"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "763"
  input: "756"
  output: "765"
  name: ""
  type: "Add"
}
op {
  input: "765"
  output: "766"
  name: ""
  type: "Relu"
}
op {
  input: "766"
  input: "1253"
  input: "1255"
  output: "767"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "767"
  output: "769"
  name: ""
  type: "Relu"
}
op {
  input: "769"
  input: "1257"
  input: "1259"
  output: "770"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "770"
  output: "772"
  name: ""
  type: "Relu"
}
op {
  input: "772"
  input: "1261"
  input: "1263"
  output: "773"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "773"
  input: "766"
  output: "775"
  name: ""
  type: "Add"
}
op {
  input: "775"
  output: "776"
  name: ""
  type: "Relu"
}
op {
  input: "776"
  input: "1265"
  input: "1267"
  output: "777"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "777"
  output: "779"
  name: ""
  type: "Relu"
}
op {
  input: "779"
  input: "1269"
  input: "1271"
  output: "780"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "780"
  output: "782"
  name: ""
  type: "Relu"
}
op {
  input: "782"
  input: "1273"
  input: "1275"
  output: "783"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "783"
  input: "776"
  output: "785"
  name: ""
  type: "Add"
}
op {
  input: "785"
  output: "786"
  name: ""
  type: "Relu"
}
op {
  input: "786"
  input: "1277"
  input: "1279"
  output: "787"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "787"
  output: "789"
  name: ""
  type: "Relu"
}
op {
  input: "789"
  input: "1281"
  input: "1283"
  output: "790"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "790"
  output: "792"
  name: ""
  type: "Relu"
}
op {
  input: "792"
  input: "1285"
  input: "1287"
  output: "793"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "793"
  input: "786"
  output: "795"
  name: ""
  type: "Add"
}
op {
  input: "795"
  output: "796"
  name: ""
  type: "Relu"
}
op {
  input: "796"
  input: "1289"
  input: "1291"
  output: "797"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "797"
  output: "799"
  name: ""
  type: "Relu"
}
op {
  input: "799"
  input: "1293"
  input: "1295"
  output: "800"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "800"
  output: "802"
  name: ""
  type: "Relu"
}
op {
  input: "802"
  input: "1297"
  input: "1299"
  output: "803"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "803"
  input: "796"
  output: "805"
  name: ""
  type: "Add"
}
op {
  input: "805"
  output: "806"
  name: ""
  type: "Relu"
}
op {
  input: "806"
  input: "1301"
  input: "1303"
  output: "807"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "807"
  output: "809"
  name: ""
  type: "Relu"
}
op {
  input: "809"
  input: "1305"
  input: "1307"
  output: "810"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "810"
  output: "812"
  name: ""
  type: "Relu"
}
op {
  input: "812"
  input: "1309"
  input: "1311"
  output: "813"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "813"
  input: "806"
  output: "815"
  name: ""
  type: "Add"
}
op {
  input: "815"
  output: "816"
  name: ""
  type: "Relu"
}
op {
  input: "816"
  input: "1313"
  input: "1315"
  output: "817"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "817"
  output: "819"
  name: ""
  type: "Relu"
}
op {
  input: "819"
  input: "1317"
  input: "1319"
  output: "820"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "820"
  output: "822"
  name: ""
  type: "Relu"
}
op {
  input: "822"
  input: "1321"
  input: "1323"
  output: "823"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "823"
  input: "816"
  output: "825"
  name: ""
  type: "Add"
}
op {
  input: "825"
  output: "826"
  name: ""
  type: "Relu"
}
op {
  input: "826"
  input: "1325"
  input: "1327"
  output: "827"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "827"
  output: "829"
  name: ""
  type: "Relu"
}
op {
  input: "829"
  input: "1329"
  input: "1331"
  output: "830"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "830"
  output: "832"
  name: ""
  type: "Relu"
}
op {
  input: "832"
  input: "1333"
  input: "1335"
  output: "833"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "833"
  input: "826"
  output: "835"
  name: ""
  type: "Add"
}
op {
  input: "835"
  output: "836"
  name: ""
  type: "Relu"
}
op {
  input: "836"
  input: "1337"
  input: "1339"
  output: "837"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "837"
  output: "839"
  name: ""
  type: "Relu"
}
op {
  input: "839"
  input: "1341"
  input: "1343"
  output: "840"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "840"
  output: "842"
  name: ""
  type: "Relu"
}
op {
  input: "842"
  input: "1345"
  input: "1347"
  output: "843"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "843"
  input: "836"
  output: "845"
  name: ""
  type: "Add"
}
op {
  input: "845"
  output: "846"
  name: ""
  type: "Relu"
}
op {
  input: "846"
  input: "1349"
  input: "1351"
  output: "847"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "847"
  output: "849"
  name: ""
  type: "Relu"
}
op {
  input: "849"
  input: "1353"
  input: "1355"
  output: "850"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "850"
  output: "852"
  name: ""
  type: "Relu"
}
op {
  input: "852"
  input: "1357"
  input: "1359"
  output: "853"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "853"
  input: "846"
  output: "855"
  name: ""
  type: "Add"
}
op {
  input: "855"
  output: "856"
  name: ""
  type: "Relu"
}
op {
  input: "856"
  input: "1361"
  input: "1363"
  output: "857"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "857"
  output: "859"
  name: ""
  type: "Relu"
}
op {
  input: "859"
  input: "1365"
  input: "1367"
  output: "860"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "860"
  output: "862"
  name: ""
  type: "Relu"
}
op {
  input: "862"
  input: "1369"
  input: "1371"
  output: "863"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "863"
  input: "856"
  output: "865"
  name: ""
  type: "Add"
}
op {
  input: "865"
  output: "866"
  name: ""
  type: "Relu"
}
op {
  input: "866"
  input: "1373"
  input: "1375"
  output: "867"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "867"
  output: "869"
  name: ""
  type: "Relu"
}
op {
  input: "869"
  input: "1377"
  input: "1379"
  output: "870"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "870"
  output: "872"
  name: ""
  type: "Relu"
}
op {
  input: "872"
  input: "1381"
  input: "1383"
  output: "873"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "873"
  input: "866"
  output: "875"
  name: ""
  type: "Add"
}
op {
  input: "875"
  output: "876"
  name: ""
  type: "Relu"
}
op {
  input: "876"
  input: "1385"
  input: "1387"
  output: "877"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "877"
  output: "879"
  name: ""
  type: "Relu"
}
op {
  input: "879"
  input: "1389"
  input: "1391"
  output: "880"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "880"
  output: "882"
  name: ""
  type: "Relu"
}
op {
  input: "882"
  input: "1393"
  input: "1395"
  output: "883"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "883"
  input: "876"
  output: "885"
  name: ""
  type: "Add"
}
op {
  input: "885"
  output: "886"
  name: ""
  type: "Relu"
}
op {
  input: "886"
  input: "1397"
  input: "1399"
  output: "887"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 2
    ints: 2
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "887"
  output: "889"
  name: ""
  type: "Relu"
}
op {
  input: "889"
  input: "1401"
  input: "1403"
  output: "890"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "890"
  output: "892"
  name: ""
  type: "Relu"
}
op {
  input: "892"
  input: "1405"
  input: "1407"
  output: "893"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "886"
  input: "1409"
  input: "1411"
  output: "895"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 2
    ints: 2
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "893"
  input: "895"
  output: "897"
  name: ""
  type: "Add"
}
op {
  input: "897"
  output: "898"
  name: ""
  type: "Relu"
}
op {
  input: "898"
  input: "1413"
  input: "1415"
  output: "899"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "899"
  output: "901"
  name: ""
  type: "Relu"
}
op {
  input: "901"
  input: "1417"
  input: "1419"
  output: "902"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "902"
  output: "904"
  name: ""
  type: "Relu"
}
op {
  input: "904"
  input: "1421"
  input: "1423"
  output: "905"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "905"
  input: "898"
  output: "907"
  name: ""
  type: "Add"
}
op {
  input: "907"
  output: "908"
  name: ""
  type: "Relu"
}
op {
  input: "908"
  input: "1425"
  input: "1427"
  output: "909"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "909"
  output: "911"
  name: ""
  type: "Relu"
}
op {
  input: "911"
  input: "1429"
  input: "1431"
  output: "912"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
    ints: 1
    ints: 1
  }
  arg {
    name: "kernels"
    ints: 3
    ints: 3
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "912"
  output: "914"
  name: ""
  type: "Relu"
}
op {
  input: "914"
  input: "1433"
  input: "1435"
  output: "915"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "915"
  input: "908"
  output: "917"
  name: ""
  type: "Add"
}
op {
  input: "917"
  output: "918"
  name: ""
  type: "Relu"
}
op {
  input: "918"
  input: "_wrapped_model.backbone.fpn_lateral5.weight"
  input: "_wrapped_model.backbone.fpn_lateral5.bias"
  output: "919"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 0
    ints: 0
    ints: 0
    ints: 0
  }
  arg {
    name: "kernels"
    ints: 1
    ints: 1
  }
  arg {
    name: "dilations"
    ints: 1
    ints: 1
  }
  arg {
    name: "strides"
    ints: 1
    ints: 1
  }
  arg {
    name: "group"
    i: 1
  }
}
op {
  input: "919"
  input: "_wrapped_model.backbone.fpn_output5.weight"
  input: "_wrapped_model.backbone.fpn_output5.bias"
  output: "920"
  name: ""
  type: "Conv"
  arg {
    name: "pads"
    ints: 1
    ints: 1
